# DimensionEqualityLabelFormatting Class

---
Instances of this class represent individual parameters used to make up a dimension equality formula for continuous linear or angular dimensions.
SystemObject Autodesk.Revit.DBDimensionEqualityLabelFormatting
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class DimensionEqualityLabelFormatting : IDisposable

    Public Class DimensionEqualityLabelFormatting
    	Implements IDisposable

    public ref class DimensionEqualityLabelFormatting : IDisposable

    type DimensionEqualityLabelFormatting =
        class
            interface IDisposable
        end
The DimensionEqualityLabelFormatting type exposes the following members.
| Name| Description
---|---|---
| DimensionEqualityLabelFormatting|  Constructs a new instance of a DimensionEqualityLabelFormatting object with specified settings.
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| LabelType|  The parameter value to be shown.
| LeadingSpaces|  The number of spaces to include before the parameter value.
| Prefix|  The prefix to include before the parameter value.
| Suffix|  The suffix to include after the parameter value.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the DimensionEqualityLabelFormatting
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetFormatOptions|  Gets the format options used to show the parameter value.
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| IsValidFormatOptions|  Checks whether a FormatOptions object is valid for the LabelType.
| SetFormatOptions|  Sets the format options used to show the parameter value.
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace